# 0)

# ვიყენებ ყველა ნასწავლ შედარების ოერაციას ისე რომ terminal-ში გამომიტანოს True

print(10 > 8)
print(10 < 12)
print(10 >= 10)
print(10 <= 10)
print(10 == 10)

# ვიყენებ ყველა ნასწავლ შედარების ოერაციას ისე რომ terminal-ში გამომიტანოს False

print(10 > 12)
print(10 < 8)
print(10 >= 12)
print(10 <= 6)
print(10 == 12)


# 1)

# მეტია -- >
# ნაკლებია -- <
# მეტია ან ტოლია -- >=
# ნაკლებია ან ტოლია -- <=
# უდრის-უდრის -- =

# 2)

# სხვანაირად ვერც გაგვცემს პასუხს, გვეუბნება ან სწორია/სიმართლეა ან არასწორია/სიცრუეა

# 3)

user_num = int(input("Enter a number: "))
print(10 > user_num)

# 4) ✅